Ran Plan for dir: `project_1` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm_instance.google_compute_instance.vm-sandeep-tf[1] has been changed
~ resource "google_compute_instance" "vm-sandeep-tf" {
        id                   = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-a/instances/vm-sandeep-2"
      + labels               = {}
      + metadata             = {}
        name                 = "vm-sandeep-2"
      + resource_policies    = []
        tags                 = [
            "sandeep-tf",
        ]
        # (16 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }
  # module.vm_instance.google_compute_instance.vm-sandeep-tf[0] has been changed
~ resource "google_compute_instance" "vm-sandeep-tf" {
        id                   = "projects/sunlit-cab-463104-m6/zones/asia-southeast1-b/instances/vm-sandeep-1"
      + labels               = {}
      + metadata             = {}
        name                 = "vm-sandeep-1"
      + resource_policies    = []
        tags                 = [
            "sandeep-tf",
        ]
        # (16 unchanged attributes hidden)

      ~ boot_disk {
            # (6 unchanged attributes hidden)

          ~ initialize_params {
              + resource_manager_tags       = {}
                # (9 unchanged attributes hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }
  # module.buckets.google_storage_bucket_object.object-sandeep[0] has been changed
~ resource "google_storage_bucket_object" "object-sandeep" {
        id               = "sandeep-bucket-1-iphone_logo"
      + metadata         = {}
        name             = "iphone_logo"
        # (14 unchanged attributes hidden)
    }
  # module.buckets.google_storage_bucket_object.object-sandeep[1] has been changed
~ resource "google_storage_bucket_object" "object-sandeep" {
        id               = "sandeep-bucket-2-iphone_logo"
      + metadata         = {}
        name             = "iphone_logo"
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.service_accounts.google_service_account.service_account[0] must be replaced
-/+ resource "google_service_account" "service_account" {
      ~ account_id   = "sandeep-service-account-1" -> "sandeep-service-account-2" # forces replacement
      ~ display_name = "Sandeep Service Account 1" -> "Sandeep Service Account 2"
      ~ email        = "sandeep-service-account-1@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> "sandeep-service-account-2@sunlit-cab-463104-m6.iam.gserviceaccount.com"
      ~ id           = "projects/sunlit-cab-463104-m6/serviceAccounts/sandeep-service-account-1@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> (known after apply)
      ~ member       = "serviceAccount:sandeep-service-account-1@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> "serviceAccount:sandeep-service-account-2@sunlit-cab-463104-m6.iam.gserviceaccount.com"
      ~ name         = "projects/sunlit-cab-463104-m6/serviceAccounts/sandeep-service-account-1@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> (known after apply)
      ~ unique_id    = "108183118907395374420" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.service_accounts.google_service_account.service_account[1] will be destroyed
- resource "google_service_account" "service_account" {
      - account_id   = "sandeep-service-account-2" -> null
      - description  = "Service account for Sandeep's project 1" -> null
      - disabled     = false -> null
      - display_name = "Sandeep Service Account 2" -> null
      - email        = "sandeep-service-account-2@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> null
      - id           = "projects/sunlit-cab-463104-m6/serviceAccounts/sandeep-service-account-2@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:sandeep-service-account-2@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> null
      - name         = "projects/sunlit-cab-463104-m6/serviceAccounts/sandeep-service-account-2@sunlit-cab-463104-m6.iam.gserviceaccount.com" -> null
      - project      = "sunlit-cab-463104-m6" -> null
      - unique_id    = "108267178913088152436" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://0e9ec8217d70:4141/lock?id=Sandeep13Paul%252Fterraform_modules%252Fproject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project_1`
</details>
Plan: 1 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
